data/ycsb-perf/emu-a-run-2097152-32-4-2024-01-12-21-55-with-append.out
[OVERALL], RunTime(ms), 284522
[OVERALL], Throughput(ops/sec), 3514.6667041564447
[TOTAL_GCS_G1_Young_Generation], Count, 18
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 80
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.028117333633251557
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 18
[TOTAL_GC_TIME], Time(ms), 80
[TOTAL_GC_TIME_%], Time(%), 0.028117333633251557
[READ], Operations, 500304
[READ], AverageLatency(us), 221.30334756468068
[READ], MinLatency(us), 3
[READ], MaxLatency(us), 274431
[READ], 95thPercentileLatency(us), 1244
[READ], 99thPercentileLatency(us), 2519
[READ], Return=OK, 500304
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 147520.0
[CLEANUP], MinLatency(us), 147456
[CLEANUP], MaxLatency(us), 147583
[CLEANUP], 95thPercentileLatency(us), 147583
[CLEANUP], 99thPercentileLatency(us), 147583
[UPDATE], Operations, 499696
[UPDATE], AverageLatency(us), 269.5176767474625
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 321023
[UPDATE], 95thPercentileLatency(us), 1300
[UPDATE], 99thPercentileLatency(us), 2593
[UPDATE], Return=OK, 499696