data/ycsb-perf/emu-b-run-2097152-32-8-2024-01-12-21-02-with-append.out
[OVERALL], RunTime(ms), 222215
[OVERALL], Throughput(ops/sec), 4500.146254753279
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 62
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.02790090677947033
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 62
[TOTAL_GC_TIME_%], Time(%), 0.02790090677947033
[READ], Operations, 949826
[READ], AverageLatency(us), 182.0214923575476
[READ], MinLatency(us), 3
[READ], MaxLatency(us), 311807
[READ], 95thPercentileLatency(us), 798
[READ], 99thPercentileLatency(us), 2191
[READ], Return=OK, 949826
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 28360.0
[CLEANUP], MinLatency(us), 28352
[CLEANUP], MaxLatency(us), 28367
[CLEANUP], 95thPercentileLatency(us), 28367
[CLEANUP], 99thPercentileLatency(us), 28367
[UPDATE], Operations, 50174
[UPDATE], AverageLatency(us), 230.55674253597482
[UPDATE], MinLatency(us), 18
[UPDATE], MaxLatency(us), 15383
[UPDATE], 95thPercentileLatency(us), 887
[UPDATE], 99thPercentileLatency(us), 2263
[UPDATE], Return=OK, 50174